/* automatically generated by rust-bindgen 0.70.1 */

#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(unused)]
pub const EDFLIBSYS_VERSION: Option<&str> = option_env!("CARGO_PKG_VERSION");

#[doc = " This structure contains the signal parameters."]
pub type edflib_param_t = edf_param_struct;
#[doc = " This structure is used for annotations/events/triggers."]
pub type edflib_annotation_t = edf_annotation_struct;
#[doc = " This structure contains the general header info and parameters. It will be filled when calling the function edfopen_file_readonly()."]
pub type edflib_hdr_t = edf_hdr_struct;
#[doc = " This structure contains the signal parameters."]
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialOrd, PartialEq)]
pub struct edf_param_struct {
    #[doc = "< Label (name) of the signal, null-terminated string."]
    pub label: [::std::os::raw::c_char; 17usize],
    #[doc = "< Number of samples in the file."]
    pub smp_in_file: ::std::os::raw::c_longlong,
    #[doc = "< Physical maximum, usually the maximum input of the ADC."]
    pub phys_max: f64,
    #[doc = "< Physical minimum, usually the minimum input of the ADC."]
    pub phys_min: f64,
    #[doc = "< Digital maximum, usually the maximum output of the ADC, cannot not be higher than 32767 for EDF or 8388607 for BDF."]
    pub dig_max: ::std::os::raw::c_int,

    #[doc = "< Null-terminated string, is always empty when filetype is EDF or BDF."]
    pub patient_name: [::std::os::raw::c_char; 81usize],
    #[doc = "< Null-terminated string, is always empty when filetype is EDF or BDF."]
    pub patient_additional: [::std::os::raw::c_char; 81usize],
    #[doc = "< Null-terminated string, is always empty when filetype is EDF or BDF."]
    pub admincode: [::std::os::raw::c_char; 81usize],
    #[doc = "< Null-terminated string, is always empty when filetype is EDF or BDF."]
    pub technician: [::std::os::raw::c_char; 81usize],
    #[doc = "< Null-terminated string, is always empty when filetype is EDF or BDF."]
    pub equipment: [::std::os::raw::c_char; 81usize],
    #[doc = "< Null-terminated string, is always empty when filetype is EDF or BDF."]
    pub recording_additional: [::std::os::raw::c_char; 81usize],
    #[doc = "< Duration of a datarecord expressed in units of 100 nanoseconds."]
    pub datarecord_duration: ::std::os::raw::c_longlong,
    #[doc = "< Number of datarecords in the file."]
    pub datarecords_in_file: ::std::os::raw::c_longlong,
    #[doc = "< Number of annotations/events/triggers in the file."]
    pub annotations_in_file: ::std::os::raw::c_longlong,
    #[doc = "< array of structs containing the signal parameters."]
    pub signalparam: [edflib_param_t; 4096usize],
}
pub const EDFLIB_TIME_DIMENSION: u32 = 10000000;
pub const EDFLIB_MAXSIGNALS: u32 = 4096;
pub const EDFLIB_MAX_ANNOTATION_LEN: u32 = 512;
pub const EDFSEEK_SET: u32 = 0;
pub const EDFSEEK_CUR: u32 = 1;
pub const EDFSEEK_END: u32 = 2;
pub const EDF_ANNOT_IDX_POS_END: u32 = 0;
pub const EDF_ANNOT_IDX_POS_MIDDLE: u32 = 1;
pub const EDF_ANNOT_IDX_POS_START: u32 = 2;
pub const EDFLIB_FILETYPE_EDF: u32 = 0;
pub const EDFLIB_FILETYPE_EDFPLUS: u32 = 1;
pub const EDFLIB_FILETYPE_BDF: u32 = 2;
pub const EDFLIB_FILETYPE_BDFPLUS: u32 = 3;
pub const EDFLIB_MALLOC_ERROR: i32 = -1;
pub const EDFLIB_NO_SUCH_FILE_OR_DIRECTORY: i32 = -2;
pub const EDFLIB_FILE_CONTAINS_FORMAT_ERRORS: i32 = -3;
pub const EDFLIB_MAXFILES_REACHED: i32 = -4;
pub const EDFLIB_FILE_READ_ERROR: i32 = -5;
pub const EDFLIB_FILE_ALREADY_OPENED: i32 = -6;
pub const EDFLIB_FILETYPE_ERROR: i32 = -7;
pub const EDFLIB_FILE_WRITE_ERROR: i32 = -8;
pub const EDFLIB_NUMBER_OF_SIGNALS_INVALID: i32 = -9;
pub const EDFLIB_FILE_IS_DISCONTINUOUS: i32 = -10;
pub const EDFLIB_INVALID_READ_ANNOTS_VALUE: i32 = -11;
pub const EDFLIB_ARCH_ERROR: i32 = -12;
pub const EDFLIB_DO_NOT_READ_ANNOTATIONS: u32 = 0;
pub const EDFLIB_READ_ANNOTATIONS: u32 = 1;
pub const EDFLIB_READ_ALL_ANNOTATIONS: u32 = 2;
pub const EDFLIB_NO_SIGNALS: i32 = -20;
pub const EDFLIB_TOO_MANY_SIGNALS: i32 = -21;
pub const EDFLIB_NO_SAMPLES_IN_RECORD: i32 = -22;
pub const EDFLIB_DIGMIN_IS_DIGMAX: i32 = -23;
pub const EDFLIB_DIGMAX_LOWER_THAN_DIGMIN: i32 = -24;
pub const EDFLIB_PHYSMIN_IS_PHYSMAX: i32 = -25;
pub const EDFLIB_DATARECORD_SIZE_TOO_BIG: i32 = -26;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of edf_param_struct"][::std::mem::size_of::<edf_param_struct>() - 232usize];
    ["Alignment of edf_param_struct"][::std::mem::align_of::<edf_param_struct>() - 8usize];
    ["Offset of field: edf_param_struct::label"]
        [::std::mem::offset_of!(edf_param_struct, label) - 0usize];
    ["Offset of field: edf_param_struct::smp_in_file"]
        [::std::mem::offset_of!(edf_param_struct, smp_in_file) - 24usize];
    ["Offset of field: edf_param_struct::phys_max"]
        [::std::mem::offset_of!(edf_param_struct, phys_max) - 32usize];
    ["Offset of field: edf_param_struct::phys_min"]
        [::std::mem::offset_of!(edf_param_struct, phys_min) - 40usize];
    ["Offset of field: edf_param_struct::dig_max"]
        [::std::mem::offset_of!(edf_param_struct, dig_max) - 48usize];
    ["Offset of field: edf_param_struct::dig_min"]
        [::std::mem::offset_of!(edf_param_struct, dig_min) - 52usize];
    ["Offset of field: edf_param_struct::smp_in_datarecord"]
        [::std::mem::offset_of!(edf_param_struct, smp_in_datarecord) - 56usize];
    ["Offset of field: edf_param_struct::physdimension"]
        [::std::mem::offset_of!(edf_param_struct, physdimension) - 60usize];
    ["Offset of field: edf_param_struct::prefilter"]
        [::std::mem::offset_of!(edf_param_struct, prefilter) - 69usize];
    ["Offset of field: edf_param_struct::transducer"]
        [::std::mem::offset_of!(edf_param_struct, transducer) - 150usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of edf_annotation_struct"][::std::mem::size_of::<edf_annotation_struct>() - 552usize];
    ["Alignment of edf_annotation_struct"]
        [::std::mem::align_of::<edf_annotation_struct>() - 8usize];
    ["Offset of field: edf_annotation_struct::onset"]
        [::std::mem::offset_of!(edf_annotation_struct, onset) - 0usize];
    ["Offset of field: edf_annotation_struct::duration_l"]
        [::std::mem::offset_of!(edf_annotation_struct, duration_l) - 8usize];
    ["Offset of field: edf_annotation_struct::duration"]
        [::std::mem::offset_of!(edf_annotation_struct, duration) - 16usize];
    ["Offset of field: edf_annotation_struct::annotation"]
        [::std::mem::offset_of!(edf_annotation_struct, annotation) - 36usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of edf_hdr_struct"][::std::mem::size_of::<edf_hdr_struct>() - 951152usize];
    ["Alignment of edf_hdr_struct"][::std::mem::align_of::<edf_hdr_struct>() - 8usize];
    ["Offset of field: edf_hdr_struct::handle"]
        [::std::mem::offset_of!(edf_hdr_struct, handle) - 0usize];
    ["Offset of field: edf_hdr_struct::filetype"]
        [::std::mem::offset_of!(edf_hdr_struct, filetype) - 4usize];
    ["Offset of field: edf_hdr_struct::edfsignals"]
        [::std::mem::offset_of!(edf_hdr_struct, edfsignals) - 8usize];
    ["Offset of field: edf_hdr_struct::file_duration"]
        [::std::mem::offset_of!(edf_hdr_struct, file_duration) - 16usize];
    ["Offset of field: edf_hdr_struct::startdate_day"]
        [::std::mem::offset_of!(edf_hdr_struct, startdate_day) - 24usize];
    ["Offset of field: edf_hdr_struct::startdate_month"]
        [::std::mem::offset_of!(edf_hdr_struct, startdate_month) - 28usize];
    ["Offset of field: edf_hdr_struct::startdate_year"]
        [::std::mem::offset_of!(edf_hdr_struct, startdate_year) - 32usize];
    ["Offset of field: edf_hdr_struct::starttime_subsecond"]
        [::std::mem::offset_of!(edf_hdr_struct, starttime_subsecond) - 40usize];
    ["Offset of field: edf_hdr_struct::starttime_second"]
        [::std::mem::offset_of!(edf_hdr_struct, starttime_second) - 48usize];
    ["Offset of field: edf_hdr_struct::starttime_minute"]
        [::std::mem::offset_of!(edf_hdr_struct, starttime_minute) - 52usize];
    ["Offset of field: edf_hdr_struct::starttime_hour"]
        [::std::mem::offset_of!(edf_hdr_struct, starttime_hour) - 56usize];
    ["Offset of field: edf_hdr_struct::patient"]
        [::std::mem::offset_of!(edf_hdr_struct, patient) - 60usize];
    ["Offset of field: edf_hdr_struct::recording"]
        [::std::mem::offset_of!(edf_hdr_struct, recording) - 141usize];
    ["Offset of field: edf_hdr_struct::patientcode"]
        [::std::mem::offset_of!(edf_hdr_struct, patientcode) - 222usize];
    ["Offset of field: edf_hdr_struct::sex"]
        [::std::mem::offset_of!(edf_hdr_struct, sex) - 303usize];
    ["Offset of field: edf_hdr_struct::gender"]
        [::std::mem::offset_of!(edf_hdr_struct, gender) - 319usize];
    ["Offset of field: edf_hdr_struct::birthdate"]
        [::std::mem::offset_of!(edf_hdr_struct, birthdate) - 335usize];
    ["Offset of field: edf_hdr_struct::birthdate_day"]
        [::std::mem::offset_of!(edf_hdr_struct, birthdate_day) - 352usize];
    ["Offset of field: edf_hdr_struct::birthdate_month"]
        [::std::mem::offset_of!(edf_hdr_struct, birthdate_month) - 356usize];
    ["Offset of field: edf_hdr_struct::birthdate_year"]
        [::std::mem::offset_of!(edf_hdr_struct, birthdate_year) - 360usize];
    ["Offset of field: edf_hdr_struct::patient_name"]
        [::std::mem::offset_of!(edf_hdr_struct, patient_name) - 364usize];
    ["Offset of field: edf_hdr_struct::patient_additional"]
        [::std::mem::offset_of!(edf_hdr_struct, patient_additional) - 445usize];
    ["Offset of field: edf_hdr_struct::admincode"]
        [::std::mem::offset_of!(edf_hdr_struct, admincode) - 526usize];
    ["Offset of field: edf_hdr_struct::technician"]
        [::std::mem::offset_of!(edf_hdr_struct, technician) - 607usize];
    ["Offset of field: edf_hdr_struct::equipment"]
        [::std::mem::offset_of!(edf_hdr_struct, equipment) - 688usize];
    ["Offset of field: edf_hdr_struct::recording_additional"]
        [::std::mem::offset_of!(edf_hdr_struct, recording_additional) - 769usize];
    ["Offset of field: edf_hdr_struct::datarecord_duration"]
        [::std::mem::offset_of!(edf_hdr_struct, datarecord_duration) - 856usize];
    ["Offset of field: edf_hdr_struct::datarecords_in_file"]
        [::std::mem::offset_of!(edf_hdr_struct, datarecords_in_file) - 864usize];
    ["Offset of field: edf_hdr_struct::annotations_in_file"]
        [::std::mem::offset_of!(edf_hdr_struct, annotations_in_file) - 872usize];
    ["Offset of field: edf_hdr_struct::signalparam"]
        [::std::mem::offset_of!(edf_hdr_struct, signalparam) - 880usize];
};
extern "C" {
